import { Button, Column } from '@/ui'
import React, { useContext } from 'react'
const Privacy = ({ onAccept }) => {
    return (
        <Column sx={{ padding: '15px', height: '100%', overflowY: 'scroll' }}>
            <span style={{ whiteSpace: 'pre-wrap' }}>
                <p><strong>นโยบายข้อมูลส่วนบุคคล บริษัท โรบอท เมคเกอร์ จำกัด</strong></p>
                <p>บริษัท โรบอท เมคเกอร์ จำกัด ในฐานะ &ldquo;ผู้ควบคุมข้อมูล&rdquo; (Data Controller) สำหรับ ชื่อแอพพลิเคชั่น LINE มีการกำหนดนโยบายการป้องกันข้อมูลส่วนบุคคล (Personal/Privacy Data Protection Policy) โดยนโยบายจะอธิบายถึงการใช้และการรักษาข้อมูลส่วนบุคคล โดยเฉพาะข้อมูลของผู้ใช้บริการระบบของ Dataslot</p>
                <p>เอกสารฉบับนี้จะแจ้งข้อมูลสำคัญ ได้แก่</p>
                <ol>
                    <li>ขอบเขตของข้อมูลส่วนบุคคล</li>
                    <li>ข้อมูลส่วนบุคคลที่เก็บรวบรวม</li>
                    <li>แหล่งที่มาของข้อมูล ที่เก็บรวบรวม</li>
                    <li>ข้อมูลของท่านถูกใช้เพื่อวัตถุประสงค์ใด</li>
                    <li>การประมวลข้อมูลส่วนบุคคล</li>
                    <li>การเก็บรักษาและระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</li>
                    <li>การใช้ข้อมูลส่วนบุคคลเพื่อการตลาด</li>
                    <li>สิทธิของเจ้าของข้อมูล</li>
                    <li>คุกกี้ (Cookies) คืออะไร</li>
                    <li>Dataslot ใช้ Cookies ทำอะไร</li>
                    <li>Cookies ประเภทใดบ้างที่ Dataslot ใช้</li>
                    <li>การบริหารจัดการ Cookies</li>
                    <li>นโยบายข้อมูลส่วนบุคคลของเว็ปไซด์อื่น</li>
                    <li>การเปลี่ยนแปลงนโยบายข้อมูลส่วนบุคคล</li>
                    <li>การติดต่อผู้ควบคุมข้อมูลส่วนบุคคลของ Dataslot&nbsp;</li>
                </ol>
                <p><strong>ขอบเขตของข้อมูลส่วนบุคคล</strong></p>
                <p>&ldquo;ข้อมูลส่วนบุคคล&rdquo; หรือ Personal Data หมายถึง ข้อมูลใดๆ ที่ระบุไปถึง &ldquo;เจ้าของข้อมูล&rdquo; (Data Subject) ได้ไม่ว่าทางตรงหรือทางอ้อม โดยไม่รวมถึงข้อมูลของผู้ที่ถึงแก่กรรม</p>
                <p>&ldquo;เจ้าของข้อมูล&rdquo; หรือ Data Subject หมายถึง บุคคลที่ข้อมูลส่วนบุคคลนั้นระบุไปถึง</p>
                <ul>
                    <li>&ldquo;บุคคล&rdquo;(Natural Person) หมายถึง บุคคลที่มีชีวิตอยู่ ไม่รวมถึง &ldquo;นิติบุคคล&rdquo; (Juridical Person) ที่จัดตั้งขึ้นตามกฎหมาย เช่น บริษัท, สมาคม, มูลนิธิ, หรือ องค์กรอื่นใด</li>
                    <li>ไม่รวมถึงกรณีที่ผู้สร้างหรือเก็บรวบรวมข้อมูลนั้น (ไม่ใช่บุคคลที่เป็นเจ้าของข้อมูล)</li>
                </ul>
                <p><strong>ข้อมูลส่วนบุคคลที่ Dataslot เก็บรวบรวม</strong></p>
                <p>ข้อมูลส่วนบุคคลที่ Dataslot เก็บรวบรวม ประกอบด้วย</p>
                <ol>
                    <li>ชื่อ-นามสกุล</li>
                    <li>วันเกิด</li>
                    <li>เบอร์โทรศัพท์</li>
                    <li>ที่อยู่</li>
                    <li>Email</li>
                    <li>รูปถ่าย</li>
                </ol>
                <p>โดยจะจัดเก็บข้อมูลส่วนบุคคลเฉพาะที่จำเป็นเท่านั้น เพื่อให้สามารถติดต่อและให้บริการท่านได้ดังนี้</p>
                <ol>
                    <li>ข้อมูลการเข้าใช้ระบบ ข้อมูลใดๆ ที่อธิบายคุณลักษณะของผู้ใช้หรือคุณลักษณะเชิงพฤติกรรมของท่าน เช่น สินค้าที่ชื่นชอบ ความสนใจ หรือวิถีชีวิตของท่าน เพื่อให้สามารถนำเสนอผลิตภัณฑ์และบริการที่ท่านอาจสนใจ</li>
                    <li>ข้อมูลการชำระเงิน ข้อมูลใดๆ ที่จำเป็นต้องใช้เพื่อดำเนินการตามคำสั่งซื้อหรือข้อมูลที่ท่านใช้ในการสั่งซื้อสินค้า เช่น ข้อมูลบัตรเดบิตหรือบัตรเครดิต (ชื่อผู้ถือบัตร หมายเลขบัตร วันหมดอายุ CVC เป็นต้น) หรือรูปแบบการชำระเงินอื่นๆ (ถ้ามี) ในกรณีใดก็ตาม Dataslot หรือผู้ให้บริการด้านการชำระเงินของ Dataslot จะจัดการกับข้อมูลการชำระเงินและข้อมูลทางการเงินด้วยวิธีการที่เป็นไปตามกฎหมาย ข้อบังคับและมาตรฐานการรักษาความปลอดภัย</li>
                    <li>Dataslot จะทำการวิเคราะห์ข้อมูลส่วนบุคคล (Personal Data Analysis) ที่ Dataslot เก็บรวบรวม เพื่อให้มั่นใจว่าข้อมูลที่ Dataslot เก็บรวบรวมเป็นข้อมูลที่จำเป็นจริงๆ และการเก็บข้อมูลมีความปลอดภัยเพียงพอ</li>
                    <li>Dataslot จะไม่เก็บรวบรวมข้อมูลส่วนบุคคลที่มีความอ่อนไหว (Sensitive Data) สำหรับการดำเนินกิจกรรมตามปกติ ยกเว้นหากมีความจำเป็นต้องมีการจัดเก็บข้อมูลอ่อนไหว Dataslot จะแจ้งเจ้าของข้อมูลล่วงหน้าเพื่อขอความยินยอมก่อนการเก็บรวบรวม</li>
                </ol>
                <p><strong>แหล่งที่มาของข้อมูล ที่ Dataslot เก็บรวบรวม</strong></p>
                <p>Dataslot อาจได้รับข้อมูลส่วนบุคคลของท่านจาก 2 ช่องทาง ดังนี้</p>
                <ol>
                    <li>Dataslot ได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง โดยจะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจาก ขั้นตอนการให้บริการดังนี้</li>
                    <ol>
                        <li>ขั้นตอนการสมัครใช้บริการหรือการลงทะเบียนกับ Dataslot หรือขั้นตอนการขอยื่นคำร้องใช้สิทธิต่างๆ กับ Dataslot</li>
                        <li>ขั้นตอนการสั่งซื้อสินค้าและบริการจาก Dataslot</li>
                        <li>การทำแบบสอบถาม (Survey) โดยความสมัครใจของท่าน</li>
                        <li>ทางการสื่อสารอื่นๆ ระหว่าง Dataslot และท่าน</li>
                        <li>การเข้าเยี่ยมชมเว็ปไซต์ของ Dataslot โดยได้ข้อมูลผ่าน Cookies ของท่าน</li>
                    </ol>
                    <li>Dataslot ได้รับข้อมูลส่วนบุคคลของท่านมาจากบุคคลที่สาม ดังต่อไปนี้</li>
                </ol>
                <ol>
                    <li>LINE ประเทศไทย</li>
                </ol>
                <p>Dataslot ได้รับข้อมูลด้วยวิธีการ ดังต่อไปนี้</p>
                <ol>
                    <li>ได้รับจากการส่งข้อมูลในรูปแบบ Electronic File</li>
                    <ol>
                        <li>Dataslot ยังอาจได้รับข้อมูลมาจากผู้อื่นซึ่งมีสถานะเป็นผู้ควบคุมข้อมูล (Data Controller) โดย Zortout สถานะเป็นผู้ประมวลผลข้อมูล (Data Processor) ตามคำสั่งของผู้ควบคุมข้อมูล</li>
                    </ol>
                </ol>
                <p><br /><br /><br /></p>
                <p><strong>Dataslot เก็บรวบรวมข้อมูลส่วนบุคคลของท่าน โดยมีวัตถุประสงค์ ดังนี้</strong></p>
                <ol>
                    <li>สามารถติดต่อสื่อสารกับท่าน ที่เกี่ยวข้องกับบริการ การดูแลลูกค้า การควบคุมคุณภาพในการให้บริการ</li>
                    <li>สามารถให้บริการตามคำสั่งซื้อของท่าน และสามารถบริหารจัดการการสมัครใช้บริการ การลงทะเบียนกับ Dataslot ของท่าน</li>
                    <li>สามารถบริหารและจัดการ การให้บริการกับท่าน</li>
                    <li>สามารถส่งอีเมล์ หรือ ส่งข้อความ (Notification) หรือ ข่าวสาร ให้ผู้ใช้บริการ เพื่อให้ทราบถึงการให้บริการที่ผู้ใช้บริการอาจสนใจ</li>
                    <li>การวิจัยและการพัฒนา และการปรับปรุงประสบการณ์ของผู้ใช้</li>
                </ol>
                <p><strong>การประมวลข้อมูลส่วนบุคคล</strong></p>
                <p>เมื่อได้รับข้อมูลส่วนบุคคลของท่านแล้ว Dataslot จะดำเนินการกับข้อมูลส่วนบุคคลของท่าน ดังนี้</p>
                <p>เก็บรวบรวม โดย Dataslot มีการเก็บข้อมูลไว้บนคลาวด์ของแอมาซอน เรียกว่า Amazon Web Services (AWS) ซึ่งเป็นระบบที่ได้มาตรฐาน มีความมั่นคงปลอดภัยสูง เป็นที่ยอมรับโดยทั่วไป และ AWS มี Data Center กระจายอยู่หลายแห่งทั่วโลก สำหรับ Dataslot มีการใช้ Data Center ที่ประเทศสิงคโปร์ เป็น Server Base โดยประเทศสิงคโปร์มีกฎหมายคุ้มครองข้อมูลส่วนบุคคล เรียกว่า Singapore Personal Data Protection Act 2012 (SGPDPA)</p>
                <p>การใช้ข้อมูล Dataslot มีวัตถุประสงค์ในการใช้ข้อมูลของท่านเพื่อติดต่อสื่อสาร, เพื่อการบริการ และการพัฒนาคุณภาพในการให้บริการกับท่าน</p>
                <p>การเปิดเผยข้อมูล Dataslot จะขอแบ่งปัน (แชร์) ข้อมูลกับบุคคลหรือหน่วยงาน เพื่อเสนอผลิตภัณฑ์และบริการต่างๆ ที่เหมาะสมให้กับท่าน และเมื่อ Dataslot ตอบรับคำสั่งซื้อของท่าน ข้อมูลอาจถูกส่งหรือใช้โดยบริษัทผู้ออกเครดิตหรือเดบิต เพื่อป้องกันการฉ้อโกง</p>
                <p><strong>การเก็บรักษาและระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</strong></p>
                <p><strong>การเก็บรักษาข้อมูล</strong></p>
                <p>Dataslot มีการเก็บข้อมูลไว้บนคลาวด์ของแอมาซอน เรียกว่า Amazon Web Services (AWS) ซึ่งเป็นระบบที่ได้มาตรฐาน มีความมั่นคงปลอดภัยสูง เป็นที่ยอมรับโดยทั่วไป และ AWS มี Data Center กระจายอยู่หลายแห่งทั่วโลก สำหรับ Dataslot มีการใช้ Data Center ที่ประเทศสิงคโปร์ เป็น Server Base โดยประเทศสิงคโปร์มีกฎหมายคุ้มครองข้อมูลส่วนบุคคล เรียกว่า Singapore Personal Data Protection Act 2012 (SGPDPA)</p>
                <p><strong>ระยะเวลาในการเก็บรักษาข้อมูล</strong></p>
                <p>Dataslot จะจัดเก็บข้อมูลส่วนบุคคลของท่านจนกว่าท่านจะเลิกใช้งานระบบ (Inactive User) ตามระยะเวลาของกฎหมายที่เกี่ยวข้องได้กำหนดไว้ โดยเมื่อท่านเลิกใช้งานระบบแล้ว Dataslot จะเปลี่ยนข้อมูลของท่าน ซึ่งทำให้ไม่สามารถระบุตัวตนของท่านได้</p>
                <p><strong>การใช้ข้อมูลส่วนบุคคลเพื่อการตลาด</strong></p>
                <p>ในระหว่างการให้บริการ Dataslot และคู่ค้าของ Dataslot จะส่งข้อมูลผลิตภัณฑ์และบริการที่คาดว่าท่านน่าจะสนใจไปให้ โดยหากท่านยอมรับข้อมูลการเสนอผลิตภัณฑ์และบริการแล้ว ท่านมีสิทธิที่จะยกเลิกได้ทุกเวลา ท่านมีสิทธิ์ที่จะติดต่อ Dataslot ให้ยกเลิกการเสนอข้อมูลผลิตภัณฑ์และบริการ หรือการให้ข้อมูลของท่านกับสมาชิกอื่นๆ ในเครือ Dataslot ได้ตลอดเวลา โดยหากท่านยกเลิกดังกล่าว Dataslot จะไม่สามารถให้บริการกับท่านได้ต่อไป</p>
                <p>กรณีที่ท่านต้องการยกเลิกท่านสามารถทำได้ดังนี้</p>
                <ol>
                    <li>เข้าไปยังผู้ให้บริการการส่ง Email ของท่าน</li>
                    <li>สร้างจดหมาย โดยใช้หัวข้อ &ldquo;แจ้งขอยกเลิกการจัดเก็บข้อมูลส่วนบุคคล&rdquo;</li>
                    <li>กรอกรายละเอียดดังนี้</li>
                    <ol>
                        <li>ชื่อ - นามสกุล</li>
                        <li>เบอร์โทรศัพท์</li>
                        <li>Display name ของ LINE application</li>
                    </ol>
                    <li>ส่ง Email ไปยัง support@dataslot.app</li>
                </ol>
                <p><strong>Dataslot ต้องการให้ท่านรับทราบเรื่องสิทธิในการคุ้มครองข้อมูล ซึ่งผู้ใช้งานทุกคนจะมีสิทธิดังต่อไปนี้</strong></p>
                <ol>
                    <li>สิทธิในการเพิกถอนความยินยอม (Right to Withdraw Consent) &ndash; ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผล รวมถึงเพิกถอนการจัดเก็บข้อมูลส่วนบุคคล ที่ท่านได้ให้ความยินยอมกับ Dataslot ได้ตลอดระยะเวลาที่ ข้อมูลส่วนบุคคลของท่านอยู่กับ Dataslot&nbsp;</li>
                    <li>สิทธิในการเข้าถึงข้อมูล (Right to Access) &ndash; ท่านมีสิทธิที่จะเข้าถึงข้อมูลส่วนบุคคลของท่านโดยการขอให้ Dataslot จัดทำสำเนาข้อมูลส่วนบุคคลของท่านให้ท่าน รวมถึงขอให้ Dataslot เปิดเผยการได้มาซึ่งข้อมูลของท่าน ซึ่งท่านไม่ได้ให้ความยินยอมต่อ Dataslot&nbsp;</li>
                    <li>สิทธิในการแก้ไขข้อมูล (Right to Rectification) &ndash; ท่านมีสิทธิที่จะขอให้ Dataslot แก้ไขข้อมูลที่ไม่ถูกต้องหรือไม่สมบูรณ์ได้</li>
                    <li>สิทธิในการลบข้อมูล (Right to Erasure) &ndash; ท่านมีสิทธิที่จะขอให้บัซซี่บีส์ลบข้อมูลส่วนตัวของท่านหรือทำให้เป็นข้อมูลที่ไม่สามารถระบุตัวตนของท่านได้ ซึ่งการลบข้อมูลบางครั้งอาจทำให้ Dataslot จะไม่สามารถให้บริการกับท่านได้ต่อไป</li>
                    <li>สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล (Right to Restriction of Processing): ท่านมีสิทธิในการระงับการใช้ข้อมูลส่วนบุคคลของท่าน ในกรณีดังต่อไปนี้</li>
                    <ol>
                        <li>เมื่อผู้ควบคุมข้อมูลส่วนบุคคลอยู่ในระหว่างการตรวจสอบตามที่เจ้าของข้อมูลส่วนบุคคลร้องขอ</li>
                        <li>เมื่อเป็นข้อมูลส่วนบุคคลที่ต้องลบหรือทำลาย แต่เจ้าของข้อมูลส่วนบุคคลขอให้ระงับการใช้แทน</li>
                        <li>เมื่อข้อมูลส่วนบุคคลหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล แต่เจ้าของข้อมูลส่วนบุคคลมีความจำเป็นต้องขอให้เก็บรักษาไว้เพื่อใช้ในการก่อตั้งสิทธิเรียกร้องตามกฎหมาย</li>
                        <li>เมื่อผู้ควบคุมข้อมูลส่วนบุคคลอยู่ในระหว่างการพิสูจน์ หรือตรวจสอบ เพื่อปฏิเสธการคัดค้านของเจ้าของข้อมูลส่วนบุคคล</li>
                        <li>สิทธิในการให้โอนย้ายข้อมูลส่วนบุคคล (Right to Data Portability): ท่านมีสิทธิในการโอนย้ายข้อมูลส่วนบุคคลของท่านที่ท่านให้ไว้กับ Dataslot ไปยังผู้ควบคุมข้อมูลรายอื่น หรือตัวท่านเอง</li>
                        <li>สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล (Right to Object): ท่านมีสิทธิในการคัดค้านการ ประมวลผลข้อมูลส่วนบุคคลของท่าน โดยหากท่านยกเลิกดังกล่าว ในกรณี ดังต่อไปนี้</li>
                        <ol>
                            <li>กรณีที่เป็นข้อมูลส่วนบุคคลที่เก็บรวบรวมได้โดยได้รับยกเว้นไม่ต้องขอความยินยอม</li>
                            <li>กรณีที่เป็นการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์เกี่ยวกับ การตลาดแบบตรง</li>
                        </ol>
                    </ol>
                </ol>
                <p>ถ้าท่านทำการส่งคำร้องเข้ามา Dataslot จะตอบกลับคำร้องของท่านภายใน 1 เดือน โดยหากท่านต้องการดำเนินการตามสิทธิดังกล่าวนี้ ท่านสามารถทำได้ดังนี้</p>
                <ol>
                    <li>เข้าไปยังผู้ให้บริการการส่ง Email ของท่าน</li>
                    <li>สร้างจดหมาย โดยใช้หัวข้อ &ldquo;แจ้งขอยกเลิกการจัดเก็บข้อมูลส่วนบุคคล&rdquo;</li>
                    <li>กรอกรายละเอียดดังนี้</li>
                    <ol>
                        <li>ชื่อ - นามสกุล</li>
                        <li>เบอร์โทรศัพท์</li>
                        <li>Display name ของ LINE application</li>
                    </ol>
                    <li>ส่ง Email ไปยัง support@dataslot.app</li>
                </ol>
                <p><br /><br /><br /></p>
                <p><strong>Cookies คืออะไร</strong></p>
                <p>Cookies คือไฟล์ข้อมูล (Text File) บนคอมพิวเตอร์ ทำหน้าที่เก็บ Log ข้อมูลอินเตอร์เน็ตและพฤติกรรมของผู้เยี่ยมชมเว็บไซต์ เมื่อท่านเข้าชมเว็บไซต์ของบัาจมีการ Dataslot เก็บข้อมูลของท่านโดยอัตโนมัติผ่าน Cookies หรือเทคโนโลยีอื่นๆ ในรูปแบบเดียวกัน</p>
                <p>สำหรับข้อมูลเพิ่มเติมเกี่ยวกับ Cookies ท่านสามารถตรวจสอบเพิ่มเติมได้ที่ www.allaboutcookies.org/manage-cookies/</p>
                <p><strong>Dataslot ใช้ Cookies ทำอะไร</strong></p>
                <p>Dataslot จะจัดเก็บข้อมูลการเข้าเยี่ยมชม Website จากผู้เข้าเยี่ยมชมทุกรายผ่าน Cookies หรือ เทคโนโลยีที่ใกล้เคียง และ Dataslot จะใช้ Cookies เพื่อประโยชน์ ในการพัฒนาประสิทธิภาพในการเข้าถึงบริการของ Dataslot ผ่าน internet, พัฒนาประสิทธิภาพในการใช้งานบริการของ Dataslot และเพื่อพัฒนาประสบการณ์การใช้งานของท่านบนเว็บไซต์ซึ่งครอบคลุมถึงสิ่งต่างๆ ดังต่อไปนี้</p>
                <ol>
                    <li>บันทึกข้อมูลการล็อกอิน (Log in/Sign in) ของท่าน เพื่อให้ท่านสามารถใช้บัญชีของท่านได้อย่างต่อเนื่อง</li>
                    <li>เพื่อทำความเข้าใจถึงการใช้งานของท่านบนเว็บไซต์ Dataslot&nbsp;</li>
                </ol>
                <p><strong>Cookies ประเภทใดบ้างที่ Dataslot ใช้</strong></p>
                <p>การใช้ Cookies มีหลากหลายประเภท แต่สำหรับเว็บไซต์ Dataslot จะใช้เพื่อเหตุผลดังต่อไปนี้</p>
                <ol>
                    <li>ในเชิงฟังก์ชั่น (Functionality Cookies) - Dataslot ใช้ Cookies เพื่อรับทราบว่าท่านได้เข้ามายังเว็บไซต์และจดจำความสนใจของท่านที่เคยเลือกไว้ รวมไปถึงภาษาที่ท่านเลือกและสถานที่ที่มีการใช้งาน Cookies ทั้งจากบุคคลที่หนึ่ง (เว็บไซต์ Dataslot) และบุคคลที่สาม (องค์กรอื่นๆ)</li>
                    <li>การโฆษณา (Advertising Cookies) &ndash; Dataslot ใช้ Cookies ในการเก็บข้อมูลเมื่อท่านเข้าชมเว็บไซต์ ไม่ว่าจะเป็นเนื้อหาที่ท่านชมลิ้งค์ที่ท่านติดตาม ข้อมูลบราวเซอร์ อุปกรณ์ และ IP Address Dataslot ได้มีการแชร์ข้อมูลในปริมาณที่จำกัดไปให้กับบุคคลที่สาม (องค์กรอื่นๆ) เพื่อจุดประสงค์ในการโฆษณา Dataslot อาจมีการแชร์ข้อมูลออนไลน์ที่เก็บผ่าน Cookies กับพันธมิตรด้านโฆษณา เมื่อเข้าชมเว็บไซต์อื่นๆ ท่านจะเห็นโฆษณาปรากฏขึ้น ซึ่งโฆษณาเหล่านี้จะอ้างอิงจากลักษณะการค้นหาของท่านบนเว็บไซต์ Dataslot browsing patterns on our website.</li>
                </ol>
                <p><strong>การบริหารจัดการ Cookies</strong></p>
                <p>ท่านสามารถตั้งค่าบราวเซอร์ของท่านไม่ให้เก็บข้อมูลผ่าน Cookies ได้ ซึ่งท่านสามารถดูรายละเอียดได้ที่ www.allaboutcookies.org/manage-cookies/ โดยเว็บไซต์ดังกล่าวจะอธิบายถึงวิธีการลบ cookies ออกจากบราวเซอร์ แต่ในบางกรณี ฟีเจอร์บางอย่างของ Dataslot อาจไม่สามารถทำเช่นนั้นได้</p>
                <p><strong>นโยบายความเป็นส่วนตัวของเว็บไซต์อื่นๆ</strong></p>
                <p>ผลิตภัณฑ์และบริการขอ Dataslot จะมีการใส่ลิ้งค์เพื่อไปยังเว็บไซต์อื่นๆ นโยบายความเป็นส่วนตัวจะครอบคลุมเฉพาะผลิตภัณฑ์และบริการของ Dataslot เท่านั้น หากท่านคลิกลิ้งค์เพื่อไปยังผลิตภัณฑ์และบริการอื่นๆ ขอแนะนำให้ท่านอ่านนโยบายความเป็นส่วนตัวของเว็บไซต์นั้นก่อน</p>
                <p><strong>การเปลี่ยนแปลงนโยบายข้อมูลส่วนบุคคล</strong></p>
                <p>นโยบายความเป็นส่วนตัว / การคุ้มครองข้อมูลส่วนบุคคลของ Dataslot จะดำเนินตามกฎหมายและข้อบังคับที่ประกาศสู่สาธารณะ นโยบายความเป็นส่วนตัวนี้มีการอัพเดทล่าสุดเมื่อวันที่ 31 พฤษภาคม 2565</p>
                <p><strong>หากต้องการยกเลิกติดต่อที่ไหน</strong></p>
                <p><strong>การติดต่อ Dataslot</strong></p>
                <p>หากมีข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัว / การคุ้มครองข้อมูลส่วนบุคคล ข้อมูลของท่านที่ Dataslot เก็บไว้หรือต้องการให้ดำเนินการตามสิทธิการคุ้มครองข้อมูลส่วนบุคคล ท่านสามารถแจ้งผ่านช่องทาง Email ได้ดังนี้</p>
                <ol>
                    <li>เข้าไปยังผู้ให้บริการการส่ง Email ของท่าน</li>
                    <li>สร้างจดหมาย โดยใช้หัวข้อ &ldquo;แจ้งขอยกเลิกการจัดเก็บข้อมูลส่วนบุคคล&rdquo;</li>
                    <li>กรอกรายละเอียดดังนี้</li>
                </ol>
                <ol>
                    <li>ชื่อ - นามสกุล</li>
                    <li>เบอร์โทรศัพท์</li>
                    <li>Display name ของ LINE application</li>
                </ol>
                <ol>
                    <li>ส่ง Email ไปยัง support@dataslot.app</li>
                </ol>
                <p><br /><br /></p>
            </span>
            <Button onClick={onAccept} variant={'primary'}>ยอมรับ</Button>
        </Column>

    )
}

export default Privacy